Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: *Data Retrieval:* Fetching data on the server, closer to the data source. This enhances performance by reducing the time needed to retrieve data for rendering and minimizes client requests.
ja_jp: *データ取得:* データソースに近いサーバー上でデータを取得します。これにより、レンダリング用のデータ取得に必要な時間が短縮され、クライアント要求が最小限に抑えられるため、パフォーマンスが向上します。

source: *Decoupled application logic*: Authorization policies are managed entirely by Keycloak, allowing your application to focus on its core functionality.
ja_jp: *分離されたアプリケーションロジック*: 認可ポリシーは Keycloak によって完全に管理されるため、アプリケーションはコア機能に集中できます。

source: *Default fast-jar*
ja_jp: *デフォルト fast-jar*

source: *Description*
ja_jp: *説明*

source: *DevOps Engineer*
ja_jp: *DevOpsエンジニア*

source: *Distinguishing multiple configurations with names:*
ja_jp: *複数の設定を名前で区別する場合:*

source: *Enhanced Security:* Storage of sensitive data and logic is happening on the server, such as tokens and API keys, without exposing them to client-side risks.
ja_jp: *セキュリティーの強化:* トークンや API キーなどの機密データやロジックは、クライアント側のリスクにさらされることなく、サーバー上で保存されます。

source: *Event-loop*, where messages are dispatched on the Vert.x I/O thread. Remember that you should not perform blocking operations on the event loop.
ja_jp: *イベントループ*: メッセージが Vert.x I/O スレッドにディスパッチされます。 イベントループではブロッキング操作を実行しないでください。

source: *Events*, the most generic signal. It's a representation of something significant happening during the execution of a program.
ja_jp: *イベント* は、最も一般的なシグナルです。プログラムの実行中に発生した重要な出来事を表します。

source: *Examples*: https://github.com/a2aproject/a2a-java/tree/main/examples
ja_jp: *例*: https://github.com/a2aproject/a2a-java/tree/main/examples

source: *Exclusive* subscription type allows specifying a _unique subscription name_ for "fan-out pub-sub messaging". This is the default subscription type.
ja_jp: *Exclusive* サブスクリプションタイプ使用すると、"ファンアウト型の pub/sub メッセージング" 用に _一意のサブスクリプション名_ を指定できます。これがデフォルトのサブスクリプションタイプです。

source: *Experimental*: early feedback is requested to mature the idea. There is no guarantee of stability nor long term presence in the platform until the solution matures. Such extensions are at the beginning of their maturation process.
ja_jp: *実験的*:アイデアを成熟させるために、早期のフィードバックが必要です。ソリューションが成熟するまで、プラットフォーム内での安定性や長期的な存在は保証されません。このようなエクステンションは、成熟プロセスの初期段階にあります。

source: *Extensions*
ja_jp: *エクステンション*

source: *Favorite*
ja_jp: *お気に入り*

source: *Field renames*: `supportsAuthenticatedExtendedCard` → `supportsExtendedAgentCard`
ja_jp: *フィールド名の変更*: `supportsAuthenticatedExtendedCard` → `supportsExtendedAgentCard`

source: *For Java 21-23 only:*
ja_jp: *Java 21-23 のみ:*

source: *For Quarkus REST*: If you are using `quarkus-rest`, `quarkus-rest-client`, or both, include the `quarkus-keycloak-admin-rest-client` extension.
ja_jp: *Quarkus REST の場合*: `quarkus-rest`、`quarkus-rest-client`、またはその両方を使用している場合は、`quarkus-keycloak-admin-rest-client` エクステンションを含めます。

source: *For RESTEasy Classic*: If you are using `quarkus-resteasy`, `quarkus-resteasy-client`, or both, include the `quarkus-keycloak-admin-resteasy-client` extension.
ja_jp: *RESTEasy Classic の場合*: `quarkus-resteasy`、`quarkus-resteasy-client`、またはその両方を使用している場合は、`quarkus-keycloak-admin-resteasy-client` エクステンションを含めます。

source: *For all Java versions (21+):*
ja_jp: *すべての Java バージョン (21+) の場合:*

source: *Front-end Developer*
ja_jp: *フロントエンドデベロッパー*

source: *Full-Stack Developer focused on rules and big-data*
ja_jp: *ルールとビッグデータにフォーカスしたフルスタックデベロッパー*

source: *Getter naming*: Records use `card.name()` instead of `card.getName()`
ja_jp: *ゲッターの命名*: レコードは `card.getName()` の代わりに `card.name()` を使用します

source: *Go for Quinoa:*
ja_jp: *以下の場合は Quinoa を利用してください*

source: *Go for Web Bundler:*
ja_jp: *以下の場合は Web Bundler を利用してください*

source: *Gson* handles JSON serialization for JSON-RPC transport
ja_jp: *Gson* はJSON-RPCトランスポートのJSONシリアライゼーションを処理します

source: *Guide* _(optional)_
ja_jp: *ガイド* _(オプション)_

source: *If no REST layer is explicitly used*: It is recommended to include the `quarkus-keycloak-admin-rest-client` extension.
ja_jp: *REST レイヤーが明示的に使用されていない場合*: `quarkus-keycloak-admin-rest-client` エクステンションを含めることを推奨します。

source: *Image credit: https://diataxis.fr/*
ja_jp: *Image credit: https://diataxis.fr/* The content types in the Diátaxis documentation framework{fn-diataxis}

source: *Improved Initial Page Load and First Contentful Paint (FCP):* Generating HTML on the server enables users to view the page immediately, eliminating the need to wait for client-side JavaScript to download, parse, and execute for rendering.
ja_jp: *初期ページ読み込みと First Contentful Paint (FCP) の改善:* サーバー上で HTML を生成することで、ユーザーはページをすぐに表示できるようになり、クライアント側の JavaScript のダウンロード、解析、レンダリングが実行されるのを待つ必要がなくなります。

source: *Issues*: https://github.com/a2aproject/a2a-java/issues
ja_jp: *課題*: https://github.com/a2aproject/a2a-java/issues

source: *Java Developer*
ja_jp: *Javaデベロッパー*

source: *Java part*
ja_jp: *Java パート*

source: *Java records* in the `spec` module provide the SDK's API
ja_jp: *Javaレコード* は `spec` モジュールでSDKのAPIを提供します

source: *Lead Architect*
ja_jp: *リード・アーキテクト*

source: *Logging*, classical local or centralised logs
ja_jp: *ロギング* 、古典的なローカルまたは集中ログ

source: *Logging*, classical local or distributed logs
ja_jp: *ロギング*、従来のローカルログまたは分散ログ

source: *Logo* _(optional)_
ja_jp: *ロゴ* _(オプション)_

source: *MC* (kick things off, transition between demos, monitor chat and questions, etc.)
ja_jp: *MC* （キックオフ、デモの移行、チャットや質問のモニターなど

source: *Mandrel native executable*
ja_jp: *Mandrel ネイティブ実行可能ファイル*

source: *MapStruct mappers* handle conversions, giving compile errors if protobuf and spec classes go out of sync
ja_jp: *MapStructマッパー* は変換を処理し、protobufと仕様クラスの同期が外れた場合にコンパイルエラーを発生させます

source: *Messaging*: The core extension defines the basic concepts and APIs to develop messaging applications
ja_jp: *メッセージング*: コアエクステンションは、メッセージングアプリケーションを開発するための基本的な概念と API を定義します。

source: *Metrics*, metrics calculated in each Quarkus application instance
ja_jp: *メトリクス*、各 Quarkus アプリケーションインスタンスで計算されるメトリクス

source: *More Details*
ja_jp: *詳細*

source: *Multiple consumer applications inside a consumer group*
ja_jp: *コンシューマーグループ内の複数のコンシューマーアプリケーション*

source: *Multiple consumer threads inside a consumer group*
ja_jp: *コンシューマーグループ内の複数のコンシューマースレッド*

source: *NOTE*: If you change the `function.json` `path` attribute or if you add a `routePrefix`, your jax-rs endpoints won't route correctly. See <<config-azure-paths>> for more information.
ja_jp: *注* : `function.json` `path` 属性を変更したり、 `routePrefix` を追加したりすると、jax-rs エンドポイントは正しくルーティングされません。詳細は link:#config-azure-paths[[config-azure-paths] ] を参照してください。

source: *Negative acknowledgment* or *acknowledgment timeout* methods for redelivery will redeliver the whole batch of messages containing at least an unprocessed message. See <<producer-batching>> for more information.
ja_jp: *否定応答* または *確認応答タイムアウト* 再配信方法では、少なくとも未処理のメッセージを含むメッセージのバッチ全体が再配信されます。 詳細は、<<producer-batching>> を参照してください。

source: *O* - off by default
ja_jp: *O* - デフォルトでオフ

source: *On Java 21-23:*
ja_jp: *Java 21-23 の場合:*

source: *On Java 24+:*
ja_jp: *Java 24+ の場合:*

source: *Organizer* (help arrange logistics, agenda, JUG communication, etc.)
ja_jp: *オーガナイザー* （ロジスティックス、アジェンダ、JUGコミュニケーションなどの手配の手伝い）

source: *Package cleanup*: The `io.a2a.apec` package has been trimmed
ja_jp: *パッケージのクリーンアップ*: `io.a2a.apec` パッケージはトリミングされました

source: *Page Links* _(optional)_
ja_jp: *ページリンク* _(オプション)_

source: *Pagination support*: The `ListTasks` and push notification configuration endpoints now support pagination with proper `Result` wrappers
ja_jp: *ページネーションのサポート*: `ListTasks` およびプッシュ通知設定エンドポイントは、適切な `Result` ラッパーを使用したページネーションをサポートするようになりました

source: *Per Application*
ja_jp: *アプリケーションごと*

source: *Pluggable HTTP client*: A new `A2AHttpClient` interface allows custom HTTP implementations, with a Vert.x-based implementation provided
ja_jp: *プラガブルHTTPクライアント*: 新しい `A2AHttpClient` インターフェースはカスタムHTTP実装を可能にし、Vert.xベースの実装が提供されています

source: *Policy flexibility*: Keycloak supports various policy types, such as attribute-based and custom policies, enabling fine-grained control.
ja_jp: *ポリシーの柔軟性*: Keycloak は、属性ベースやカスタムポリシーなど、さまざまなポリシータイプをサポートしており、きめ細かい制御が可能です。

source: *Presenter* (demo Quarkus feature/capability of your choosing)
ja_jp: *プレゼンター* （任意のQuarkusの機能／性能をデモする

source: *Preview*: backward compatibility and presence in the ecosystem is not guaranteed. Specific improvements might require to change configuration or APIs and plans to become _stable_ are under way. Such extensions are in the middle of their maturation process.
ja_jp: *プレビュー*:下位互換性とエコシステム内での存在感は保証されません。特定の改善には、構成またはAPIの変更が必要になる場合があり、_安定_になる計画が進行中です。このようなエクステンションは、成熟プロセスの途中です。

source: *Profiling*, to analyze and monitor the application's performance, resource usage, and runtime behavior
ja_jp: *プロファイリング* ：アプリケーションのパフォーマンス、リソースの使用状況、実行時の動作を分析・監視します。

source: *Project Leyden and aot-jar*
ja_jp: *Project Leyden および aot-jar*

source: *Protobuf definitions* in `a2a.proto` define the wire format
ja_jp: *Protobuf定義* は `a2a.proto` でワイヤーフォーマットを定義します

source: *Protocol version*: Update to `AgentCard.CURRENT_PROTOCOL_VERSION` (now `"1.0"`)
ja_jp: *プロトコルバージョン*: `AgentCard.CURRENT_PROTOCOL_VERSION` (現在 `"1.0"`) に更新する

source: *Pub/Sub: Multiple consumer groups subscribed to a topic*
ja_jp: *Pub/Sub: トピックにサブスクライブしている複数のコンシューマーグループ*

source: *Q&A* (monitor chat and answer any questions behind the scenes or live)
ja_jp: *Q&A* （チャットを監視し、舞台裏やライブで質問に答える

source: *Quarkus Micrometer OTLP registry*: to be used with the Micrometer OTLP registry extension.
ja_jp: *Quarkus Micrometer OTLP registry*: Micrometer OTLP レジストリーエクステンションで使用されます。

source: *Quarkus Micrometer OpenTelemetry*: to be used with the Micrometer and OpenTelemetry extension.
ja_jp: *Quarkus Micrometer OpenTelemetry*: Micrometer および OpenTelemetry エクステンションで使用されます。

source: *Quarkus Micrometer Prometheus registry*: to be used with the Micrometer Prometheus registry extension.
ja_jp: *Quarkus Micrometer Prometheus registry*: Micrometer Prometheus レジストリーエクステンションで使用されます。

source: *Quarkus OpenTelemetry Logging*: to view logs coming from the OpenTelemetry extension.
ja_jp: *Quarkus OpenTelemetry Logging*: OpenTelemetry エクステンションからのログを表示します。

source: *R* - recommended
ja_jp: *R* - 推奨

source: *Refined error handling*: Error classes have been reworked to match the 1.0 specification's error model.
ja_jp: *エラーハンドリングの改善*: エラークラスは、1.0仕様のエラーモデルに合うように再設計されました。

source: *Removed kind discriminators*: The 1.0 specification eliminates the `kind` field as a type discriminator, simplifying the protocol.
ja_jp: *種類識別子の削除*: 1.0仕様では、`kind` フィールドを型識別子として廃止し、プロトコルを簡素化しました。

source: *Repository*: https://github.com/a2aproject/a2a-java
ja_jp: *リポジトリ*: https://github.com/a2aproject/a2a-java

source: *Required keys*
ja_jp: *必須キー*

source: *Resource connections over the network***:** Snapshots do not guarantee connections back to remote hosts when a function is resumed. Developers will need to ensure and validate the state of connections. + *Pulling in-memory data from sources*: Often, one needs to pull data from a different source into memory. This can also lead to inconsistency if the data at the source has changed or even expired. Ensure and verify the state of such data. + *Randomness*: Lambda SnapStart speeds up applications by re-using a single initialized snapshot many times over to resume execution environments. As a result, unique content which was included in the snapshot during initialization may be reused across execution environments and so may no longer remain unique. Ensure that unique content is generated after initialization, and avoid caching unique content during initialization. Refer to the feature documentation to understand these considerations around uniqueness and interfaces available to customers to restore uniqueness.
ja_jp: *ネットワーク経由のリソース接続*: スナップショットは、関数再開時にリモートホストに接続が戻ることを保証するものではありません。開発者は、接続の状態を確認し、検証する必要があります。 + *ソースからのインメモリデータの引き出し* :しばしば、別のソースからデータをメモリに取り込む必要があります。この場合、ソースにあるデータが変更されていたり、有効期限が切れていたりすると、不整合になる可能性があります。そのようなデータの状態を確認し、検証してください。+ *ランダム性* :Lambda SnapStartは、初期化済の単一のスナップショットを何度も再利用して実行環境を再開することで、アプリケーションを高速化します。その結果、初期化時にスナップショットに含まれていたユニークなコンテンツが、実行環境間で再利用されるため、ユニークさが保てなくなる可能性があります。初期化後にユニークコンテンツが生成されるようにし、初期化中にユニークコンテンツのキャッシュを行わないようにしてください。このようなユニーク性についての考慮事項や、ユニーク性を回復するためにお客様が利用できるインターフェイスについては、機能のドキュメントを参照してください。

source: *Runtime Init*. Well nothing fancy here, we do classic run time code execution. So, the more code you run during the two phases above, the faster your application will start.
ja_jp: *ランタイム Init* このフェーズでは特に目立つことはありません。従来的なランタイムコード実行を行います。 つまり、上記の 2 つのフェーズでより多くのコードを実行すればするほど、アプリケーションの起動が速くなります。

source: *Search Engine Optimization (SEO) and Social Media Shareability:* The rendered HTML aids search engine indexing and social network previews, enhancing discoverability and shareability.
ja_jp: *検索エンジン最適化 (SEO) とソーシャルメディアの共有可能性:* レンダリングされた HTML は、検索エンジンのインデックス作成とソーシャルネットワークのプレビューに役立ち、発見可能性と共有可能性を高めます。

source: *Serialization*: If you relied on Jackson annotations, migrate to Gson patterns
ja_jp: *シリアル化*: Jackson のアノテーションに依存していた場合は、Gson パターンに移行してください

source: *Server keystore*: Contains the server's certificate and private key.
ja_jp: *サーバーのキーストア*: サーバーの証明書と秘密鍵が格納されます。

source: *Server truststore*: Stores the client's certificate for authenticating the client.
ja_jp: *サーバーのトラストストア*: クライアントを認証するためのクライアント証明書が保存されます。

source: *Shared*, *Key_Shared* or *Failover* subscription types allow multiple consumers to share the _same subscription name_, to achieve "message queuing" among consumers.
ja_jp: *Shared*、*Key_Shared*、または *Failover* サブスクリプションタイプを使用すると、複数のコンシューマーで _同じサブスクリプション名_ を共有して、コンシューマー間で "メッセージキューイング" を実現できます。

source: *Single consumer thread inside a consumer group*
ja_jp: *コンシューマーグループ内の単一のコンシューマースレッド*

source: *Slack Message*
ja_jp: *Slackメッセージ*

source: *Specification*: https://github.com/a2aproject/A2A
ja_jp: *仕様*: https://github.com/a2aproject/A2A

source: *Stable*: backward compatibility and presence in the ecosystem are taken very seriously. An application can safely rely on these extensions. Extensions not marked as preview or experimental (the majority) are stable.
ja_jp: *安定*:下位互換性とエコシステムでの存在感が非常に重要視されています。アプリケーションはこれらのエクステンションに安全に依存できます。プレビューまたは実験的(大部分)としてマークされていないエクステンションは安定しています。

source: *Static Init*. During the run time, Quarkus will execute first a static init method which contains some extensions actions/configurations. When you will do your native packaging, this static method will be pre-processed during the build time and the objects it has generated will be serialized into the final native executable, so the initialization code will not be executed in the native mode (imagine you execute a Fibonacci function during this phase, the result of the computation will be directly recorded in the native executable). When running the application in JVM mode, this static init phase is executed at the start of the application.
ja_jp: *静的 Init* 実行時に、Quarkus は最初に、いくつかの拡張アクション/設定を含む最初の静的 init メソッドを実行します。 ネイティブパッケージングを行う場合、このスタティックメソッドはビルド時に前処理され、生成されたオブジェクトは最終的なネイティブ実行可能ファイルにシリアライズされるため、初期化コードはネイティブモードでは実行されません (このフェーズではフィボナッチ関数を実行すると想像してください。計算の結果は、ネイティブ実行可能ファイルに直接記録されます)。 JVM モードでアプリケーションを実行している場合、この静的 init フェーズはアプリケーションの開始時に実行されます。

source: *Storage Setting*
ja_jp: *ストレージ設定*

source: *TCK progress*: Continuous work towards full compliance with the 1.0 Test Compatibility Kit. The TCK is also work in progress, while the specification is being finalised.
ja_jp: *TCKの進捗*: 1.0 Test Compatibility Kitへの完全な準拠に向けた継続的な取り組み。仕様が最終決定段階にある間、TCKも進行中です。

source: *Template extension methods* are used to extend the set of accessible properties of data objects.
ja_jp: *テンプレート拡張メソッド* は 、データオブジェクトのアクセス可能なプロパティーのセットを拡張するために使用されます。

source: *The OpenTelemetry SDK will handle all metrics.* Either Micrometer metrics (manual or automatic) and OpenTelemetry Metrics can be used. All are available with this single extension.
ja_jp: *OpenTelemetry SDK はすべてのメトリクスを処理します。* Micrometer メトリクス (手動または自動) と OpenTelemetry メトリクスのいずれかを使用できます。この単一のエクステンションですべてが利用できます。

source: *The certificate file* - a `.crt` or `.pem` file
ja_jp: *証明書ファイル* - `.crt`または `.pem` ファイル

source: *The certificate file* - a `.crt` or `.pem` file.
ja_jp: *証明書ファイル* - `.crt` または `.pem` ファイル

source: *The legacy properties* with prefix `quarkus.opentelemetry.*` are currently being mapped to the new ones as a default, during a transition period. See Default column in the details below.
ja_jp: プレフィックスが `quarkus.opentelemetry.*` の *レガシープロパティは* 、現在、移行期間中、デフォルトとして新しいプロパティにマッピングされています。詳細は以下の「デフォルト」欄を参照してください。

source: *The private key file* - often a `.key` file
ja_jp: *秘密鍵ファイル* - 多くの場合は `.key` ファイル

source: *The private key file* - often a `.key` file.
ja_jp: *秘密鍵ファイル* - 多くの場合は `.key` ファイル

source: *This is an advanced subject*.
ja_jp: *これは高度なトピックです*。

source: *This is an advanced subject*. For more details on context propagation please check the above section about <<propagators-reference>>.
ja_jp: *これは高度なトピックです*。コンテキスト伝播の詳細については、<<propagators-reference>> の上記のセクションを参照してください。

source: *This release contains breaking changes.* We made the deliberate decision not to maintain backward compatibility with the 0.3.x series, as 1.0 represents the first "proper" release of the specification. This allows us to build on a solid foundation without carrying forward legacy patterns.
ja_jp: *このリリースには破壊的な変更が含まれています。* 1.0が仕様の最初の「正式な」リリースであるため、当社は0.3.xシリーズとの後方互換性を維持しないという意図的な決定をしました。これにより、レガシーパターンを引き継ぐことなく、強固な基盤の上に構築できます。

source: *Title*
ja_jp: *タイトル*

source: *Tracing*, distributed tracing across applications
ja_jp: *トレーシング*、アプリケーション間の分散トレーシング

source: *Underlying Library* _(optional)_
ja_jp: *基盤となるライブラリ* _(オプション)_

source: *Updating your JavaScript pages*
ja_jp: *JavaScript ページの更新*

source: *User oriented:* Contains terms and keywords that are familiar to users.
ja_jp: *ユーザーオリエンテッドである:* ユーザーにとって身近な用語やキーワードが含まれている。

source: *Virtual-threads*, where messages are dispatched on a virtual thread (requires Java 21+). As virtual threads are not pooled, a new virtual thread is created for each message. Please refer to the dedicated xref:messaging-virtual-threads.adoc[Quarkus Virtual Thread support] guide for more information.
ja_jp: *仮想スレッド*: メッセージは仮想スレッドにディスパッチされます (Java 21 以降が必要です)。 仮想スレッドはプールされないため、メッセージごとに新しい仮想スレッドが作成されます。 詳細は、専用の xref:messaging-virtual-threads.adoc[Quarkus Virtual Thread サポート] ガイドを参照してください。

source: *We recommend using a bundler for production* as it offers better control, consistency, security, and performance. The good news is that Quarkus makes it really easy and fast with the https://docs.quarkiverse.io/quarkus-web-bundler/dev/[Quarkus Web Bundler extension].
ja_jp: 制御性、一貫性、セキュリティー、パフォーマンスが向上するため、*実稼働環境ではバンドラーを使用することを推奨します*。Quarkus では https://docs.quarkiverse.io/quarkus-web-bundler/dev/[Quarkus Web Bundler エクステンション] を使用することで、バンドラーの使用が簡単かつ迅速になります。

source: *Webcomponent (Javascript) part*
ja_jp: *Webcomponent (Javascript) パート*

source: *Worker-threads*, where messages are dispatched on a worker thread pool.
ja_jp: *ワーカースレッド*: メッセージはワーカースレッドプールにディスパッチされます。

source: *Workspace*
ja_jp: *ワークスペース*

source: *X* - supports
ja_jp: *X* - サポート

source: *dead-letter-cause*: the cause of the failure if any
ja_jp: *dead-letter-cause*: エラーの原因 (エラーがある場合)

source: *dead-letter-offset*: the original offset of the record (long mapped to String)
ja_jp: *dead-letter-offset*: レコードの元のオフセット (String にマップされた long)

source: *dead-letter-partition*: the original partition of the record (integer mapped to String)
ja_jp: *dead-letter-partition*: レコードの元のパーティション (String にマップされた integer)

source: *dead-letter-reason*: the reason of the failure
ja_jp: *dead-letter-reason*: 失敗の理由

source: *dead-letter-topic*: the original topic of the record
ja_jp: *dead-letter-topic*: レコードの元のトピック

source: *default*: Generates structured logs based on the `key,values` present in the log record. Mapped Diagnostic Context (MDC) and Nested Diagnostic Context (NDC) data are included under the `mdc` and `ndc` fields.
ja_jp: *default*: ログレコードに含まれる `key,values` に基づいて構造化ログを生成します。Mapped Diagnostic Context (MDC) および Nested Diagnostic Context (NDC) のデータは、`mdc` および `ndc` フィールドに含まれます。

source: *dev* - Activated when in development mode (i.e. `quarkus:dev`)
ja_jp: *dev* - 開発モードのときに有効 (つまり `quarkus:dev`)

source: *docs* (optional): The docs should follow the link:https://docs.antora.org/antora/2.3/standard-directories/[Antora's Standard File and Directory Set]. See an example link:https://github.com/quarkiverse/quarkiverse-freemarker/tree/b41701b05f5886fd7c91148cdd273028fcd28950/docs[here].
ja_jp: *docs* (オプション)。docsは https://docs.antora.org/antora/2.3/standard-directories/[Antoraの標準ファイルとディレクトリーセット]に従ってください。サンプルは https://github.com/quarkiverse/quarkiverse-freemarker/tree/b41701b05f5886fd7c91148cdd273028fcd28950/docs[ここ] を参照して下さい。

source: *ecs*: Uses the link:https://www.elastic.co/docs/reference/ecs/ecs-field-reference[Elastic Common Schema (ECS)] format. This format modifies some default field names and adds other fields to align with ECS.
ja_jp: *ecs*: link:https://www.elastic.co/docs/reference/ecs/ecs-field-reference[Elastic Common Schema (ECS)] フォーマットを使用します。このフォーマットは、一部のデフォルトフィールド名を変更し、ECS に合わせるために他のフィールドを追加します。

source: *executable* (any executable prefixed with `quarkus-` found locally)
ja_jp: *実行可能ファイル* (ローカルで見つかった `quarkus-` で始まる実行可能ファイル)

source: *gcp*: Uses the link:https://cloud.google.com/logging/docs/structured-logging#structured_logging_special_fields[Google Cloud] format. This format follows the *default* format.
ja_jp: *gcp*: link:https://cloud.google.com/logging/docs/structured-logging#structured_logging_special_fields[Google Cloud] フォーマットを使用します。このフォーマットは *default* フォーマットに従います。

source: *jar* (any runnable jar found locally)
ja_jp: *jar* (ローカルで見つかった実行可能な jar)

source: *jbang alias* (any jbang alias prefixed with `quarkus-` installed locally or through the quarkusio catalog)
ja_jp: *jbang エイリアス* (ローカルにインストールされた、または quarkusio カタログを通じてインストールされた、 `quarkus-` で始まる任意の jbang エイリアス)

source: *maven* (any maven coordinate in GACTV form pointing to a runnable jar)
ja_jp: *maven* (実行可能な jar を指す GACTV 形式の任意の Maven 座標)

source: *process* streams of records as they occur or retrospectively.
ja_jp: レコードのストリームを発生時または遡及的に *処理* します。

source: *prod* - The default profile when not running in development or test mode
ja_jp: *prod* - 開発モードまたはテストモード以外で使用されるデフォルトプロファイル

source: *publish* (write) and *subscribe* to (read) streams of events, called _records_.
ja_jp: _レコード_ と呼ばれるイベントのストリームを *発行* （書き込み）したり、 *購読* （読み込み）したりすることができます。

source: *store* streams of records durably and reliably inside _topics_.
ja_jp: レコードのストリームを _トピック_ 内に永続的かつ確実に *保存* します。

source: *test* - Activated when running tests
ja_jp: *test* - テストを実行しているときに有効

source: + - The associated recorder should use the provided `MetricsFactory` to register metrics, for example
ja_jp: + - 関連するレコーダは、提供された `MetricsFactory` を使用してメトリクスを登録する必要があります。例:

source: + . To start a Keycloak server, you can use Docker to run the following command:
ja_jp: + . Keycloak サーバーを起動するには、Docker を使用して次のコマンドを実行します。

source: --enable-preview on Java 19 and 20
ja_jp: Java 19 と 20 における --enable-preview

source: -> going to end event `return person.isAdult() == true;` with language `Java`
ja_jp: -> イベント `return person.isAdult() == true;` を `Java` 言語で終了させる。

source: -> going to user task `return person.isAdult() == false;` with language `Java`
ja_jp: -> ユーザータスク `return person.isAdult() == false;` を `Java` 言語で終了させる。

source: -replacement body handler.
ja_jp: -代替ボディ・ハンドラー。

source: ... and a name of a method that should compute the value of the header. It can either be a static method or a default method in this interface
ja_jp: そして、ヘッダーの値を計算するメソッドの名前を指定します。このインターフェイスでは、静的メソッドまたはデフォルトメソッドのいずれかです。
